doom.org
* Introduction
Emacs config based on doom emacs. All config is divided up as much as is possible.
** Ideas
- Make source block keys work only when entering insert mode
- In general see if there are ways to take advantage of evil setup in org mode
- Get rid of emacs keybindings completely and only leave evil bindings
* Emacs init
This bootstraps doom and sets up a few things thtat this depends on such as the
username.

Only real updates to this should be to add doom modules and the likes.

#+BEGIN_SRC emacs-lisp :tangle "~/Github/doom-emacs/init.el" :mkdirp yes
  ;;; init.el -*- lexical-binding: t; -*-
  ;;
  ;; Author:  Henrik Lissner <henrik@lissner.net>
  ;; URL:     https://github.com/allforabit/.emacs.d
  ;;
  ;;   =================     ===============     ===============   ========  ========
  ;;   \\ . . . . . . .\\   //. . . . . . .\\   //. . . . . . .\\  \\. . .\\// . . //
  ;;   ||. . ._____. . .|| ||. . ._____. . .|| ||. . ._____. . .|| || . . .\/ . . .||
  ;;   || . .||   ||. . || || . .||   ||. . || || . .||   ||. . || ||. . . . . . . ||
  ;;   ||. . ||   || . .|| ||. . ||   || . .|| ||. . ||   || . .|| || . | . . . . .||
  ;;   || . .||   ||. _-|| ||-_ .||   ||. . || || . .||   ||. _-|| ||-_.|\ . . . . ||
  ;;   ||. . ||   ||-'  || ||  `-||   || . .|| ||. . ||   ||-'  || ||  `|\_ . .|. .||
  ;;   || . _||   ||    || ||    ||   ||_ . || || . _||   ||    || ||   |\ `-_/| . ||
  ;;   ||_-' ||  .|/    || ||    \|.  || `-_|| ||_-' ||  .|/    || ||   | \  / |-_.||
  ;;   ||    ||_-'      || ||      `-_||    || ||    ||_-'      || ||   | \  / |  `||
  ;;   ||    `'         || ||         `'    || ||    `'         || ||   | \  / |   ||
  ;;   ||            .===' `===.         .==='.`===.         .===' /==. |  \/  |   ||
  ;;   ||         .=='   \_|-_ `===. .==='   _|_   `===. .===' _-|/   `==  \/  |   ||
  ;;   ||      .=='    _-'    `-_  `='    _-'   `-_    `='  _-'   `-_  /|  \/  |   ||
  ;;   ||   .=='    _-'          '-__\._-'         '-_./__-'         `' |. /|  |   ||
  ;;   ||.=='    _-'                                                     `' |  /==.||
  ;;   =='    _-'                                                            \/   `==
  ;;   \   _-'                                                                `-_   /
  ;;    `''                                                                      ``'
  ;;
  ;; These demons are not part of GNU Emacs.
  ;;
  ;;; License: MIT

  (require 'core (concat user-emacs-directory "core/core"))

  ;; (setq user-login-name "allforabit")

  ;; Utf-8 
  ;; (prefer-coding-system 'utf-8)
  ;; (set-default-coding-systems 'utf-8)
  ;; (set-language-environment 'utf-8)
  ;; (set-selection-coding-system 'utf-8)

  ;; Setup path (windows only for now)
  (when (string-equal system-type "windows-nt")
    (setenv "PATH"
      (concat
      ;; "C:/msys64/mingw64/bin" ";"
      "C:/msys64/usr/bin" ";"
      (getenv "PATH"))))

  (doom! :feature
          popup             ; tame sudden yet inevitable temporary windows
          ;debugger           ; FIXME stepping through code, to help you add bugs
          eval            ; repls, runners 'n builders; run code, run
          evil            ; come to the dark side, we have cookies
          file-templates  ; auto-snippets for empty files
          (lookup
           +devdocs
           +docsets) ; helping you get around
          services
          snippets        ; my elves. They type so I don't have to
          spellcheck      ; tasing you for misspelling mispelling
          syntax-checker  ; tasing you for every semicolon you forget
          version-control ; remember, remember that commit in November
          workspaces      ; tab emulation, persistence & separate workspaces

          :completion
          company         ; the ultimate code completion backend
          ivy             ; a search engine for love and life
          ;helm            ; the *other* search engine for love and life
          ;ido             ; the other *other* search engine...

          :ui
          doom            ; what makes DOOM look the way it does
          doom-dashboard  ; a nifty splash screen for Emacs
          doom-modeline   ; a snazzy Atom-inspired mode-line
          doom-quit       ; DOOM quit-message prompts when you quit Emacs
          hl-todo         ; highlight TODO/FIXME/NOTE tags
          nav-flash       ; blink the current line after jumping
          evil-goggles    ; display visual hints when editing in evil
          (window-select +ace-window)
          unicode         ; extended unicode support for various languages
          ;tabbar          ; FIXME an (incomplete) tab bar for Emacs

          :lang
          (org              ; organize your plain life in plain text
                              +attach          ; custom attachment system
                              +babel           ; running code in org
                              +capture         ; org-capture in and outside of Emacs
                              +export          ; centralized export system + more backends
                              +present         ; Emacs for presentations
                              ;; TODO +publish
                              )
          ;assembly        ; assembly for fun or debugging
          cc              ; C/C++/Obj-C madness
          clojure
          ;crystal         ; ruby at the speed of c
          ;csharp          ; unity, .NET, and mono shenanigans
          data            ; config/data formats
          ;elixir          ; erlang done right
          ;elm             ; care for a cup of TEA?
          emacs-lisp      ; drown in parentheses
          ;go              ; the hipster dialect
          haskell         ; a language that's lazier than I am
          ;hy              ; readability of scheme w/ speed of python
          java            ; the poster child for carpal tunnel syndrome
          javascript      ; all(hope(abandon(ye(who(enter(here))))))
          ;julia           ; a better, faster MATLAB
          latex           ; writing papers in Emacs has never been so fun
          ledger          ; an accounting system in Emacs
          ;lua             ; one-based indices? one-based indices
          markdown        ; writing docs for people to ignore
          ;ocaml           ; an objective camel
          ;perl            ; write code no one else can comprehend
          php             ; make php less awful to work with
          plantuml        ; diagrams for confusing people more
          ;purescript      ; javascript, but functional
          ;python          ; beautiful is better than ugly
          rest            ; Emacs as a REST client
          ;ruby            ; 1.step do {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
          ;rust            ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
          ;scala           ; java, but good
          sh              ; she sells (ba|z)sh shells on the C xor
          ;swift           ; who asked for emoji variables?
          typescript      ; javascript, but better
          web             ; the tubes
          :tools
          dired           ; making dired pretty [functional]
          electric-indent ; smarter, keyword-based electric-indent
          eshell          ; a consistent, cross-platform shell (WIP)
          gist            ; interacting with github gists
          impatient-mode  ; show off code over HTTP
          ;macos           ; MacOS-specific commands
          neotree         ; a project drawer, like NERDTree for vim
          password-store  ; password manager for nerds
          rotate-text     ; cycle region at point between text candidates
          term            ; terminals in Emacs
          tmux            ; an API for interacting with tmux
          upload          ; map local to remote projects via ssh/ftp


          ;; Applications are complex and opinionated modules that transform Emacs
          ;; toward a specific purpose. They may have additional dependencies and
          ;; should be loaded last.
          :app
          email           ; emacs as an email client
          irc             ; how neckbeards socialize
          rss             ; emacs as an RSS reader
          twitter         ; twitter client https://twitter.com/vnought
          write           ; emacs as a word processor (latex + org + markdown)

          ;; Private modules named after your username are loaded automatically.
          ;; Leaving this here is harmless though. Also, they are omitted from
          ;; source control (except for mine; use it as a reference).
          ;; original value: allforabit
          :private
          default
          allforabit)

        #+END_SRC

        #+RESULTS:
        : Doom modules initialized

* Private init
The private init is run before all other modules.
#+BEGIN_SRC emacs-lisp :tangle "~/Github/doom-emacs/modules/private/allforabit/init.el" :mkdirp yes
;;; private/allforabit/init.el -*- lexical-binding: t; -*-

;; To fix node modules??
;; Maybe should be only added in special circumstances
(setq org-babel-temporary-directory "~/Documents/Bitbucket/org/tmp")
;; TODO this slow down startup

(unless (file-directory-p org-babel-temporary-directory)
  (make-directory org-babel-temporary-directory))

(defvar +org-babel-languages
  '(calc
    css
    emacs-lisp
    haskell
    js
    typescript
    latex
    ledger
    lilypond
    lisp
    matlab
    plantuml
    python
    restclient ; ob-restclient
    ruby
    rust       ; ob-rust
    shell
    sqlite
    sql-mode   ; ob-sql-mode
    translate) ; ob-translate
  "A list of org-babel languages to load.")

;; I've swapped these keys on my keyboard
(setq x-super-keysym 'alt
      x-alt-keysym   'meta
      user-mail-address "kevnolan@gmail.com"
      user-full-name    "Kevin Nolan")


(def-package-hook! rtags :disable)

;; Org stuff
(setq +org-dir "~/Bitbucket/org/")

(after! org
  ;; TODO Figure out how to get this to work
  ;; This isn't working and is taking over other modes
  ;; (map! (:mode org-mode (:map ivy-mode-map
  ;;       [remap imenu] #'counsel-org-goto)))
  (setq org-ellipsis "…"))

(setq org-default-notes-file (concat +org-dir "notes.org")
      org-capture-templates
      '(("t" "Todo" entry
         (file+headline (expand-file-name "gtd.org" +org-dir) "Inbox")
         "* [ ] %?\n%i" :prepend t :kill-buffer t)
        ("c" "Code journal" entry (file+olp+datetree "~/Bitbucket/org/code.org" "Journal")
         "* %?\nEntered on %U\n  %i\n  %a"
         :jump-to-captured t)
        ("n" "Notes" entry
         (file+headline org-default-notes-file "Inbox")
         "* %u %?\n%i" :prepend t :kill-buffer t)))

;; Use git bash for shell
;; TODO maybe should be msys2??
;; (setq explicit-shell-file-name
;;       "C:/Program Files (x86)/Git/bin/bash.exe")
;; (setq shell-file-name explicit-shell-file-name)
;; (add-to-list 'exec-path "C:/Program Files (x86)/Git/bin")

;; An extra measure to prevent the flash of unstyled mode-line while Emacs is
;; booting up (when Doom is byte-compiled).
;; (setq-default mode-line-format nil)
;; TODO try Fira Mono
(setq doom-big-font (font-spec :family "Source Code Pro" :size 19))
(setq doom-font (font-spec :family "Source Code Pro" :size 14)
      doom-variable-pitch-font (font-spec :family "Georgia")
      doom-unicode-font (font-spec :family "Symbola")
      ;; ui/doom-modeline
      +doom-modeline-height 23
      ;; `doom-themes'
      doom-neotree-enable-variable-pitch nil
      doom-neotree-project-size 1.2
      doom-neotree-line-spacing 0
      doom-neotree-folder-size 1.0
      doom-neotree-chevron-size 0.6)

#+END_SRC

#+RESULTS:
: 0.6
* Packages  
** Management
*** [ ] Add image+
 https://github.com/mhayashi1120/Emacs-imagex
*** [ ] Add ahk
https://melpa.org/#/ahk-mode
** Main
The packages to install go here.

#+BEGIN_SRC emacs-lisp :tangle  "~/Github/doom-emacs/modules/private/allforabit/packages.el" :mkdirp yes
;; TODO should config not be in config.el
(package! drupal-mode
 :config
 (setq drupal-drush-program "c:/Bitnami/drupal-7.56-2/apps/drupal/drush/dr.bat"))


(package! ob-typescript)
(package! rich-minority)
(package! lispy)
;; (package! psysh)
(package! livid-mode)
(package! list-processes+)
;; (packp)

;; (package! solarized-theme)

;; (package! org-trello)

(package! emacs-snippets
  :recipe (:fetcher github
           :repo "allforabit/emacs-snippets"
           :files ("*")))

(package! fakecygpty 
  :recipe (:fetcher github
           :repo "d5884/fakecygpty"
           :files ("*")))
#+END_SRC

#+RESULTS:
| fakecygpty      | :recipe | (fakecygpty :fetcher github :repo d5884/fakecygpty :files (*))                |
| emacs-snippets  | :recipe | (emacs-snippets :fetcher github :repo allforabit/emacs-snippets :files (*))   |
| list-processes+ |         |                                                                               |
| livid-mode      |         |                                                                               |
| lispy           |         |                                                                               |
| rich-minority   |         |                                                                               |
| ob-typescript   |         |                                                                               |
| drupal-mode     | :config | (setq drupal-drush-program c:/Bitnami/drupal-7.56-2/apps/drupal/drush/dr.bat) |

* Config
This is loaded last. Most stuff should go in here.

#+NAME: doom-drupal
#+BEGIN_SRC emacs-lisp 
#+END_SRC

