doom.org
** Temp mode

#+NAME: config-temp-mode
#+BEGIN_SRC emacs-lisp

;; temp-mode.el
;; Temporary minor mode
;; Main use is to enable it only in specific buffers to achieve the goal of
;; buffer-specific keymaps

(defvar temp-mode-map (make-sparse-keymap)
  "Keymap while temp-mode is active.")

;;;###autoload
(define-minor-mode temp-mode
  "A temporary minor mode to be activated only specific to a buffer."
  nil
  :lighter " Temp"
  temp-mode-map)

;; (provide 'temp-mode)

;; Source: https://emacs.stackexchange.com/questions/519/key-bindings-specific-to-a-buffer
;; Usage:
;; eval: (temp-mode 1)
;; eval: (define-key temp-mode-map (kbd "<f10>") 'function-ONE)
#+END_SRC

#+RESULTS: config-temp-mode
| keymap |

** Org
 - Make org blocks editable courtesy of Jon Kitchen technique
 - Make it possible to send org babel js to skewer mode
#+NAME: config-skewer-js
#+BEGIN_SRC js
// this code goes in skewer.js, to replace the current version of skewer.fn.eval.

/**
 ,* Handles an code evaluation request from Emacs.
 ,* @param request The request object sent by Emacs
 ,* @returns The result object to be returned to Emacs
 ,*/


skewer.fn.evalBabel = function(request) {
    var result = {
        strict: request.strict
    };
    var start = skewer.now();
    var oc = console.log;
    var strResult = '';
    try {
        if (!request.verbose) {
            console.log = function() {
                for (var i = 0; i < arguments.length; i++) {
                    if (i > 0) {
                        strResult += ' ';
                    }
                    strResult += String(arguments[i]);
                }
                strResult += '';
            };
        }
        var prefix = '';
        var value = skewer.globalEval(prefix + request.eval);
        if (!strResult) {
            strResult = skewer.safeStringify(value, request.verbose) + '';
        }
        result.value = strResult;
    } catch (error) {
        result = skewer.errorResult(error, result, request);
    } finally {
        console.log = oc;
    }
    result.time = (skewer.now() - start) / 1000;
    return result;
};



#+END_SRC

#+RESULTS: config-skewer-js

#+NAME: config-org
#+BEGIN_SRC emacs-lisp :noweb yes  
;; TODO these requires should probably be done using after and the likes
;; Check in doom project
(require 'lispy)
(require 'org-mouse)
(require 'ob-js)
(require 'cl)
(require 'rjsx-mode)

(defun a4b-org-mode-hook ()
  (setq-local yas-buffer-local-condition
              '(not (org-in-src-block-p t))))
(add-hook 'org-mode-hook #'a4b-org-mode-hook)

(defun a4b-org-babel-skewer-js-hook ()
  (insert "
<<config-skewer-js>>
"))

;; Setup org src to use more space
(set! :popup "^\\*Org Src"    '((size . 0.8)) '((quit) (select . t) (modeline . t)))

(remove-hook 'skewer-js-hook 'a4b-org-babel-skewer-js-hook)
(add-hook 'skewer-js-hook 'a4b-org-babel-skewer-js-hook)

(advice-remove 'org-babel-execute:js #'a4b-org-babel-execute:skewer)
(advice-add 'org-babel-execute:js :around 'a4b-org-babel-execute:skewer)
(defun a4b-org-babel-execute:skewer (oldFunc body params)
  (if (skewer-ping)
      (lexical-let* ((result-type (cdr (assoc :result-type params)))
                     (full-body (org-babel-expand-body:generic
                                 body params (org-babel-variable-assignments:js params)))
                     (pos (point)))
        (skewer-eval full-body (lambda (result)
                                 (let ((value))
                                   (goto-char pos)
                                   (print (alist-get 'value result))
                                   ;; (org-babel-insert-result
                                   ;;  (alist-get 'value result))
                                   )) :type "eval")
        nil)
    (apply oldFunc body params nil)))


;; https://lists.gnu.org/archive/html/emacs-orgmode/2014-06/msg00238.html
(defun a4b-org-export-remove-prelim-headlines (tree backend info)
  "Remove headlines tagged \"prelim\" while retaining their
contents before any export processing."
  (org-element-map tree org-element-all-elements
    (lambda (object)
      (when (and (equal 'headline (org-element-type object))
                 (member "prelim" (org-element-property :tags object)))
        (mapc (lambda (el)
                ;; recursively promote all nested headlines
                (org-element-map el 'headline
                  (lambda (el)
                    (when (equal 'headline (org-element-type el))
                      (org-element-put-property el
                                                :level (1- (org-element-property :level el))))))
                (org-element-insert-before el object))
              (cddr object))
        (org-element-extract-element object)))
    info nil org-element-all-elements)
  tree)

(add-hook 'org-export-filter-parse-tree-functions
          'a4b-org-export-remove-prelim-headlines)

(defcustom allforabit-src-block-keymaps
  '()
  "alist of custom keymaps for src blocks.")

(setq allforabit-src-block-keymaps
        `(("js" . ,(let ((map (make-composed-keymap `(,rjsx-mode-map
                                                      ,outline-minor-mode-map)
                                                    org-mode-map)))
                     (define-key map (kbd "C-c C-c") 'org-ctrl-c-ctrl-c)
                     map))
          ("emacs-lisp" . ,(let ((map (make-composed-keymap `(,lispy-mode-map
                                                              ,emacs-lisp-mode-map
                                                              ,outline-minor-mode-map)
                                                            org-mode-map)))
                             (define-key map (kbd "C-c C-c") 'org-ctrl-c-ctrl-c)
                             map))))

(defun allforabit-add-keymap-to-src-blocks (limit)
  "Add keymaps to src-blocks defined in `allforabit-src-block-keymaps'."
  (let ((case-fold-search t)
        lang)
    (while (re-search-forward org-babel-src-block-regexp limit t)
      (let ((lang (match-string 2))
            (beg (match-beginning 0))
            (end (match-end 0)))
        (if (assoc (org-no-properties lang) allforabit-src-block-keymaps)
            (progn
              (add-text-properties
               beg end `(local-map ,(cdr (assoc
                                          (org-no-properties lang)
                                          allforabit-src-block-keymaps))))
              (add-text-properties
               beg end `(cursor-sensor-functions
                         ((lambda (win prev-pos sym)
                            ;; This simulates a mouse click and makes a menu change
                            (org-mouse-down-mouse nil)))))))))))


(defun allforabit-spoof-mode (orig-func &rest args)
  "Advice function to spoof commands in org-mode src blocks.
It is for commands that depend on the major mode. One example is
`lispy--eval'."
  (if (org-in-src-block-p)
      (let ((major-mode (intern (format "%s-mode" (first (org-babel-get-src-block-info))))))
        (apply orig-func args))
    (apply orig-func args)))

(define-minor-mode allforabit-src-keymap-mode
  "Minor mode to add mode keymaps to src-blocks."
  :init-value nil
  (if allforabit-src-keymap-mode
      (progn
        (add-hook 'org-font-lock-hook #'allforabit-add-keymap-to-src-blocks t)
        (add-to-list 'font-lock-extra-managed-props 'local-map)
        (add-to-list 'font-lock-extra-managed-props 'cursor-sensor-functions)
        (advice-add 'lispy--eval :around 'allforabit-spoof-mode)
        (cursor-sensor-mode +1)
        (message "allforabit-src-keymap-mode enabled"))
    (remove-hook 'org-font-lock-hook #'allforabit-add-keymap-to-src-blocks)
    (advice-remove 'lispy--eval 'allforabit-spoof-mode)
    (cursor-sensor-mode -1))
  (font-lock-fontify-buffer))

;; (add-hook 'org-mode-hook (lambda ()
;; 			   (allforabit-src-keymap-mode +1)))

;; (org-babel-do-load-languages
;;  'org-babel-load-languages
;;  '((clojure     . t)
;;    (emacs-lisp . t)))

#+END_SRC

#+RESULTS: config-org
: ~/Documents/Bitbucket/org/tmp

** Term
#+NAME: config-term
#+BEGIN_SRC emacs-lisp
;; (def-package! fakecygpty
;;   :config
;;   (message "Activating Fake cyg pty")
;;   (fakecygpty-activate))

;; (make-comint-in-buffer "cmd" nil "cmd" nil)
;; (setq explicit-shell-file-name "c:/msys64/usr/bin/bash.exe")
;; (setq shell-file-name explicit-shell-file-name)
#+END_SRC

#+RESULTS: config-term
: c:/msys64/usr/bin/bash.exe

** Services
#+NAME: config-services
#+BEGIN_SRC emacs-lisp
(after! prodigy
  (prodigy-define-service
    :name "WLB electron"
    :command "c:/Users/admin/Documents/Bitbucket/wlb/wlb-ui-desktop/node_modules/.bin/electron.cmd"
    :args '(".")
    :cwd "c:/Users/admin/Documents/Bitbucket/wlb/wlb-ui-desktop/app"
    :tags '(work)
    :stop-signal 'sigkill
    :kill-process-buffer-on-stop t)
  (prodigy-define-service
    :name "Campus 2017"
    :command "gulp"
    :args '("watch")
    :cwd "c:/Users/admin/Documents/Bitbucket/campus/wp-content/themes/campus-theme/"
    :tags '(work)
    :stop-signal 'sigkill
    :kill-process-buffer-on-stop t)
  (prodigy-define-service
    :name "React sandbox"
    :command "yarn"
    :args '("start")
    :cwd "c:/Users/admin/Documents/Bitbucket/org/code/js/react"
    :tags '(play)
    :stop-signal 'sigkill
    :kill-process-buffer-on-stop t)
(prodigy-define-service
    :name "Mailcatcher (1080, 1025)"
    :command "mailcatcher"
    :tags '(work)
    :stop-signal 'sigkill
    :kill-process-buffer-on-stop t))
#+END_SRC

#+RESULTS: config-services
| :name | Mailcatcher (1080, 1025) | :command | mailcatcher                                                                          | :tags | (work)  | :stop-signal | sigkill                                                                   | :kill-process-buffer-on-stop | t      |              |         |                              |   |          |                   |
| :name | React sandbox            | :command | yarn                                                                                 | :args | (start) | :cwd         | c:/Users/admin/Documents/Bitbucket/org/code/js/react                      | :tags                        | (play) | :stop-signal | sigkill | :kill-process-buffer-on-stop | t |          |                   |
| :name | Campus 2017              | :command | gulp                                                                                 | :args | (watch) | :cwd         | c:/Users/admin/Documents/Bitbucket/campus/wp-content/themes/campus-theme/ | :tags                        | (work) | :stop-signal | sigkill | :kill-process-buffer-on-stop | t |          |                   |
| :name | WLB electron             | :command | c:/Users/admin/Documents/Bitbucket/wlb/wlb-ui-desktop/node_modules/.bin/electron.cmd | :args | (.)     | :cwd         | c:/Users/admin/Documents/Bitbucket/wlb/wlb-ui-desktop/app                 | :tags                        | (work) | :stop-signal | sigkill | :kill-process-buffer-on-stop | t |          |                   |
| :name | Angular 4 sandbox        | :command | yarn                                                                                 | :args | (start) | :cwd         | ~/Documents/Github/angular4-sandbox/                                      | :tags                        | (play) | :stop-signal | sigkill | :kill-process-buffer-on-stop | t | :process | Angular 4 sandbox |


** Lookup

#+NAME: config-lookup
#+BEGIN_SRC emacs-lisp
;; (setq +lookup-open-url-fn 'eww)
#+END_SRC

#+RESULTS: config-lookup
: eww
** JS
Js is evaluated in a temporary folder, so node_path needs to be explicitly set
#+NAME: config-js
#+BEGIN_SRC emacs-lisp
(setenv "NODE_PATH"
  (concat
   "~/Documents/Bitbucket/org/node_modules" ":"
   (getenv "NODE_PATH")
  )
)

(def-package! ob-typescript)

#+END_SRC

#+RESULTS: config-js

** Conclusion
#+BEGIN_SRC emacs-lisp :tangle "~/Github/doom-emacs/modules/private/allforabit/config.el" :mkdirp yes :noweb yes
;;; private/allforabit/config.el -*- lexical-binding: t; -*-
;; (def-package! solarized-theme 
;;   :demand t
;;   :config
;;   (load-theme 'solarized-dark))
<<config-org>>
<<config-temp-mode>>
<<config-term>>
<<config-services>>
<<config-lookup>>
<<config-js>>


;; Image refresh fix
;; https://emacs.stackexchange.com/questions/2303/making-an-image-ie-image-mode-auto-reload-changes-from-disk
(add-hook 'image-mode #'auto-image-file-mode)

;; Make magit work
(set! :popup "^\\*magit" :ignore)

;; UTF-8 everywhere
(setq-default buffer-file-coding-system 'utf-8-unix)
(setq-default default-buffer-file-coding-system 'utf-8-unix)
(set-default-coding-systems 'utf-8-unix)
(prefer-coding-system 'utf-8-unix)

;; Package to filter modeline items
;; TODO not working at the moment
(def-package! rich-minority
  :config
  (rich-minority-mode 1)
  (setq rm-whitelist ""))

(def-package! list-processes+)

;; ;; Don't use default snippets, use mine.
;; ;; TODO add my snippets
;; (after! yasnippet
;;   (setq yas-snippet-dirs (list "~/Github/doom-emacs/modules/private/allforabit/snippets")))

(def-package! emacs-snippets :after yasnippet)



;; Make it possible to add hashes and euro symbols
(setq mac-right-option-modifier nil)
;; from modules/completion/company/config.el
;; Drupal mode

;; (def-package! drupal-mode)

;; (def-package! psysh)
(def-package! livid-mode)
;; (def-package! ob-php)

(load! +bindings)  ; my key bindings

;;
;; (after! doom-themes
;;   ;; Since Fira Mono doesn't have an italicized variant, highlight it instead
;;   (set-face-attribute 'italic nil
;;                       :weight 'ultra-light
;;                       :foreground "#ffffff"
;;                       :background (doom-color 'current-line)))


(setq org-babel-clojure-backend 'cider)

;; app/email
(after! mu4e
  (setq smtpmail-stream-type 'starttls
        smtpmail-default-smtp-server "smtp.gmail.com"
        smtpmail-smtp-server "smtp.gmail.com"
        smtpmail-smtp-service 587)

  (set! :email "gmail.com"
    '((mu4e-sent-folder       . "/gmail.com/Sent Mail")
      (mu4e-drafts-folder     . "/gmail.com/Drafts")
      (mu4e-trash-folder      . "/gmail.com/Trash")
      (mu4e-refile-folder     . "/gmail.com/All Mail")
      (smtpmail-smtp-user     . "kevnolan")
      (user-mail-address      . "kevnolan@gmail.com")
      (mu4e-compose-signature . "---\nKevin Nolan")))
  )

(after! evil-escape
  (setq evil-escape-excluded-states '(normal visual multiedit emacs motion)
        evil-escape-excluded-major-modes '(neotree-mode)
        evil-escape-key-sequence "fd"
        evil-escape-delay 0.25))

#+END_SRC

