doom.org
* Bindings
:PROPERTIES:
:END:

#+BEGIN_SRC emacs-lisp :results code
(setq my-list '(apple orange peach))
#+END_SRC

#+RESULTS:
#+BEGIN_SRC emacs-lisp
(apple orange peach)
#+END_SRC

#+NAME: doom-keymap
#+BEGIN_SRC emacs-lisp :results code

;; Example
;; (map!
;;  ;; --- Global keybindings ---------------------------
;;  ;; Make M-x available everywhere
;;  :nvime "M-x" #'execute-extended-command
;;  "M-+"    (λ! (text-scale-set 0))
;;  "M-="    #'text-scale-increase
;;  "M--"    #'text-scale-decrease

;;  (:prefix "C-x"
;;    "p" #'doom/other-popup)

;;  ;; --- <leader> -------------------------------------
;;  (:leader
;;    :desc "Ex command"  :nv ";"   #'evil-ex
;;    (:desc "previous..." :prefix "["
;;      :desc "Spelling correction" :n  "S" #'flyspell-correct-previous-word-generic)))

;; (org-get-header-list a4b-an-el)
;; (a4b-org-element-map (org-element-contents el) results)
(defun a4b-org-element-map (tree results)
    (org-element-map 
          tree 
          'headline
        (lambda (el) 
                (if (org-element-contents el)
                    ;; Recurse in if there's contents
                    (if (org-element-property :F el)
                        (thread-last results
                            (cons "Bo")
                            (cons (org-element-property :K el)))    
                      ;; Pass results unchanged if there's no :K
                        (a4b-org-element-map (org-element-contents el) results))
                  ;; Otherwise return heading value
                  (if (org-element-property :K el)
                    (thread-last results
                        ((lambda (res)
                           (cons (org-element-property :F el) res)
                           "Hi"
                        ))
                        (cons (org-element-property :K el)))
                        )
                    (thread-last results
                        (cons "Yo")
                        (cons (org-element-property :K el))))
                ) nil nil '(headline)))

;; a4b-an-el
(thread-first
    (a4b-org-element-map
        (org-element-parse-buffer 'headline) '())
    ;; (map!)
)
#+END_SRC

#+RESULTS: doom-keymap
#+BEGIN_SRC emacs-lisp
((nil "Yo")
 ((((nil "Yo")))
  ((nil "Yo")
   (nil "Yo"))
  (((nil "Yo")
    (nil "Yo"))))
 ((((nil "Yo"))
   ((((nil "Yo")
      ((nil "Yo")
       (nil "Yo")
       (nil "Yo")
       (nil "Yo")
       (("M-!" "Yo")
        (nil "Yo")
        (nil "Yo")
        (nil "Yo"))
       (nil "Yo")
       (nil "Yo")
       (nil "Yo")
       (nil "Yo")))))))
 ((nil "Yo")
  (nil "Yo")))
#+END_SRC

#+RESULTS:


#+BEGIN_SRC emacs-lisp :results code
;; (map!
;;   (("M-!" (lambda () (interactive) (message "hello")))))
;; (make-symbol "#'foo")

(map! 
((("M-!" 'spacemacs/alternate-buffer-in-persp)
  (nil nil)
  (nil nil)))
)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC emacs-lisp
nil
#+END_SRC


** Meta-! 
:PROPERTIES:
:K:        M-!
:F:        spacemacs/alternate-buffer-in-persp
:END:


#+BEGIN_SRC emacs-lisp
(thread-last '(5 6 7 89 9)
  (seq-map (lambda (n) (+ n 1)))
  (seq-map (lambda (n) (* n n n))))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp
(org-element-map (org-element-parse-buffer) 'paragraph
  (lambda (paragraph)
    (let ((parent (org-element-property :parent paragraph)))
      (and (eq (org-element-type parent) 'section)
           (let ((first-child (car (org-element-contents parent))))
             (eq first-child paragraph))
           ;; Return value.
           paragraph))))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp
(save-excursion
  (outline-up-heading 1) 
  (org-element-map (org-element-parse-buffer) 'section
     (lambda (section)
          (org-element-property :value section))))
#+END_SRC

#+RESULTS:



** TODO Global 
** TODO Leader 
** Raw 

#+BEGIN_SRC emacs-lisp :tangle  "~/Github/doom-emacs/modules/private/allforabit/+bindings.el" :mkdirp yes

;;; private/allforabit/+bindings.el -*- lexical-binding: t; -*-


(defun spacemacs/helm-jump-in-buffer ()
  "Jump in buffer using `imenu' facilities and helm."
  (interactive)
  (call-interactively
   (cond
    ((eq major-mode 'org-mode) 'helm-org-in-buffer-headings)
    (t 'helm-semantic-or-imenu))))

(defun spacemacs/alternate-buffer-in-persp ()
  "Switch back and forth between current and last buffer in the
  current perspective."
  (interactive)
  (with-persp-buffer-list ()
                          (switch-to-buffer (other-buffer (current-buffer) t))))

(defun spacemacs/persp-helm-mini ()
  "As `helm-mini' but restricts visible buffers by perspective."
  (interactive)
  (with-persp-buffer-list ()
                          (helm-mini)))

(map!
 (:leader
   :desc "Execute extended command"    :n "SPC" #'execute-extended-command
   :desc "Switch to last buffer" :n "TAB"   #'spacemacs/alternate-buffer-in-persp
   (:desc "buffer" :prefix "b"
     :desc "Switch workspace buffer" :n "b" #'persp-switch-to-buffer
     :desc "Kill buffer"             :n "d" #'kill-this-buffer)

   (:desc "eval" :prefix "e"
     :desc "List errors"               :n  "x" #'flycheck-list-errors
     :desc "Evaluate buffer/region"    :n  "e" #'+eval/buffer
                                       :v  "e" #'+eval/region
     :desc "Evaluate & replace region" :nv "E" #'+eval:replace-region
     :desc "Build tasks"               :nv "b" #'+eval/build
     :desc "Jump to definition"        :n  "d" #'+jump/definition
     :desc "Jump to references"        :n  "D" #'+jump/references
     :desc "Open REPL"                 :n  "r" #'+eval/open-repl
                                       :v  "r" #'+eval:repl)
   ;; TODO may not be the best use of j prefix
   (:desc "Jumping" :prefix "j"
     :desc "Jump in" :nv "i" #'imenu
     :desc "Jump in" :nv "I" #'imenu-anywhere
     :desc "Jump to" :nv "j" #'evil-avy-goto-char
     :desc "Jump to 2 char" :nv "J" #'evil-avy-goto-char-2)

   (:desc "File" :prefix "f"
     :desc "Save file" :nv "s" #'save-buffer
     :desc "Find file" :nv "f" #'counsel-find-file)

   ;; Change to spacemacs prefix
   (:desc "workspace" :prefix "l"
     :desc "Display tab bar"          :n "TAB" #'+workspace/display
     :desc "New workspace"            :n "n"   #'+workspace/new
     :desc "Restore workspace from file" :n "r"   #'+workspace/load
     :desc "Restore last session"        :n "R"   (λ! (+workspace/load-session))
     :desc "Save workspace to file"   :n "s"   #'+workspace/save
     :desc "Autosave current session" :n "S"   #'+workspace/save-session
     :desc "Switch workspace"         :n "l"   #'+workspace/switch-to
     :desc "Kill all buffers"         :n "x"   #'doom/kill-all-buffers
     :desc "Delete session"           :n "X"   #'+workspace/kill-session
     :desc "Delete this workspace"    :n "d"   #'+workspace/delete
     :desc "Load session"             :n "L"   #'+workspace/load-session
     :desc "Next workspace"           :n "]"   #'+workspace/switch-right
     :desc "Previous workspace"       :n "["   #'+workspace/switch-left
     :desc "Switch to 1st workspace"  :n "1"   (λ! (+workspace/switch-to 0))
     :desc "Switch to 2nd workspace"  :n "2"   (λ! (+workspace/switch-to 1))
     :desc "Switch to 3rd workspace"  :n "3"   (λ! (+workspace/switch-to 2))
     :desc "Switch to 4th workspace"  :n "4"   (λ! (+workspace/switch-to 3))
     :desc "Switch to 5th workspace"  :n "5"   (λ! (+workspace/switch-to 4))
     :desc "Switch to 6th workspace"  :n "6"   (λ! (+workspace/switch-to 5))
     :desc "Switch to 7th workspace"  :n "7"   (λ! (+workspace/switch-to 6))
     :desc "Switch to 8th workspace"  :n "8"   (λ! (+workspace/switch-to 7))
     :desc "Switch to 9th workspace"  :n "9"   (λ! (+workspace/switch-to 8))
     :desc "Switch to last workspace" :n "0"   #'+workspace/switch-to-last)
   
   (:desc "open" :prefix "o"
          :desc "Terminal"              :n  "t" #'+eshell/open-popup
          :desc "Terminal in project"   :n  "T" #'projectile-run-eshell)
   
   (:desc "project" :prefix "p"
          :desc "Pop term in project"     :n  "o" #'projectile-run-eshell)
   
   )
(:map evil-window-map ; prefix "C-w"
        "C"     #'ace-delete-window)

  (:map evil-window-map ; prefix "C-w"
        "C"     #'ace-delete-window)

  ;; ivy
  ;; May not need to redefine all these
  (:after ivy
    :map ivy-minibuffer-map
    "C-h" #'ivy-backward-delete-char)

 
  ;; Add j/k bindings
  (:after company
    (:map company-active-map
      ;; Don't interfere with `evil-delete-backward-word' in insert mode
      "C-w"        nil
      "C-o"        #'company-search-kill-others
      "C-j"        #'company-select-next
      "C-k"        #'company-select-previous
      "C-l"        #'company-complete-selection)
    ;; Automatically applies to `company-filter-map'
    (:map company-search-map
      "C-j"        #'company-search-repeat-forward
      "C-k"        #'company-search-repeat-backward)))
    #+END_SRC

        #+RESULTS:
        : company-search-repeat-backward

        
#+BEGIN_SRC emacs-lisp

#+END_SRC

* Git ignore

#+BEGIN_SRC txt :tangle "~/Github/doom-emacs/modules/private/allforabit/.gitignore" :mkdirp yes
snippets
.authinfo.gpg
#+END_SRC

#+BEGIN_SRC emacs-lisp
(message "hi")
#+END_SRC

#+RESULTS:
: hi

#+BEGIN_SRC js
return 17 + 201;
#+END_SRC

#+RESULTS:
: 218
